{
   "RECIPES":[
      {
         "RecipeName":"Quick Garlicky Pasta",
         "Tags":[
            "Italian",
            "Under 30 Minutes",
            "Pasta",
            "Vegetarian"
         ],
         "Ingredients": [
            "Olive Oil",
            "Pasta",
            "Garlic",
            "Vegetable",
            "Chili Flakes",
            "Herbs",
            "Lemon"
         ],
         "Procedure":[
            "Cook pasta according to package instructions, drain and set aside.",
            "While the pasta is cooking, heat the oil in a large, flat pan on medium-high, and sear or brown the vegetables, if using any.  Then reduce the heat and allow the vegetables to cook, at most ten minutes.",
            "Add garlic, chopped fine.  This should be about when the pasta is ready and just as the vegetables still have some bite.  Stir fry briefly with herbs and chili flakes if using.",
            "Remove from heat and toss with pasta, adding lemon juice or zest if desired."
         ],
         "Equipment":[
            "Stove",
            "Large Pot",
            "Medium or Large Pan",
            "Collander",
            "Knives and Cutting Board",
            "Flat Spatula",
            "Large Spoon"
         ]
      }, 
      {
         "RecipeName":"Stir Fry",
         "Tags":[
            "Chinese",
            "Under 30 Minutes",
            "Rice Dish",
            "Stir Fry"
         ],
         "Ingredients": [
            "Oil",
            "Rice",
            "Garlic",
            "Green Vegetable",
            "Scallions",
            "Ginger",
            "Broth",
            "Cornstarch",
            "Soy Sauce",
            "Meat"
         ],
         "Procedure":[
            "Cook the rice.",
            "When the rice is about halfway done, heat the oil in a large, rounded pan on medium-high, and add the scallions and ginger, if using, stirring lightly so they do not burn.",
            "Add meat, keeping it moving lightly around the pan, until it seems to be mostly cooked, about a minute.",
            "Add the vegetables(sliced) and garlic, chopped fine, continuing to keep the mixture in contact with the bottom of the pan for as brief a moment at a time as you can.",
            "If you're using it, mix some broth with a spoonful of soy sauce and a spoonful of cornstarch and add to the pan, stirring to incorporate this sauce.  Remove from heat within the minute, and serve immediately over rice."
         ],
         "Equipment":[
            "Stove",
            "Rice Cooker or Saucepan",
            "Medium or Large Pan or Wok",
            "Knives and Cutting Board",
            "Flat Spatula",
            "Large Spoon"
         ]
      },
      {
         "RecipeName":"Fridge Cleanup Casserole",
         "Tags":[
            "Western",
            "Casserole",
            "Vegetarian"
         ],
         "Ingredients": [
            "Olive Oil",
            "Bread",
            "Garlic",
            "Bell Peppers",
            "Mushrooms",
            "Tomatoes",
            "Chili Flakes",
            "Herbs",
            "Eggs",
            "Milk",
            "Cheese",
            "Salt and Pepper"
         ],
         "Procedure":[
            "Heat the oven to 375^F.",
            "Brush a baking dish with oil.",
            "Whisk together eggs, milk, herbs, salt and pepper.",
            "Layer bread torn into chunks, vegetables and cheese until the baking dish is 3/4 of the way full.",
            "Gently pour the egg mixture over the layers and top with any remaining cheese.",
            "Bake for approximately 40 minutes, or until a fork inserved at the center can be removed cleanly.",
            "Once removed from the oven, let the casserole rest for 10 minutes before serving."
         ],
         "Equipment":[
            "Oven",
            "Baking Dish",
            "Knives and Curing Board"
         ]
      }
   ]
}





